- **Terraform formatting and style 🖌 ``**
- **Terraform initialization ⚙️ `success`**
- **Terraform plan 📖 `success`**
- **Terraform validation 🤖 `success`**
<details><summary>Show plan output</summary>
```

module.processing_queue["prod"].data.archive_file.processing_lambda_source: Reading...
module.photo_bucket["prod"].aws_cloudfront_origin_access_identity.photo_oai: Refreshing state... [id=E2L20GH2AV9ZRW]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Reading...
module.frontend_bucket["prod"].aws_cloudfront_origin_access_identity.frontend_oai: Refreshing state... [id=EKGC0XQKA7JD2]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue-dlq: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-prod-dlq]
module.photo_bucket["prod"].aws_s3_bucket.photo_s3_bucket: Refreshing state... [id=bata-media-photo-prod]
aws_s3_bucket.mysql_backup_bucket: Refreshing state... [id=bata-media-db-backup]
module.frontend_bucket["prod"].aws_s3_bucket.frontend_s3_bucket: Refreshing state... [id=bata-media-frontend-prod]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-trust-policy: Read complete after 0s [id=2690255455]
module.processing_queue["prod"].aws_iam_role.lambda-execution-role: Refreshing state... [id=media-photo-processing-prod-execution-role]
module.processing_queue["prod"].data.archive_file.processing_lambda_source: Read complete after 1s [id=3042021a6eaddf6b0d6a56bbf4ab74138376d848]
module.processing_queue["prod"].aws_lambda_function.processing_lambda: Refreshing state... [id=photo-processing-lambda-prod]
module.processing_queue["prod"].aws_sqs_queue.photo-processing-queue: Refreshing state... [id=https://sqs.eu-west-1.amazonaws.com/172483268424/media-photo-processing-prod]
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Reading...
module.processing_queue["prod"].data.aws_iam_policy_document.lambda-role-policy-document: Read complete after 0s [id=2010748321]
module.processing_queue["prod"].aws_iam_policy.lambda-role-policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/media-photo-processing-prod-processing-policy]
module.processing_queue["prod"].aws_iam_role_policy_attachment.lambda-execution-role-policy: Refreshing state... [id=media-photo-processing-prod-execution-role-20250328201712565400000008]
module.processing_queue["prod"].aws_lambda_event_source_mapping.processing_lambda_event_mapping: Refreshing state... [id=016be879-7beb-4bdb-af72-9f3abcf6f087]
module.frontend_bucket["prod"].aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-frontend-prod-upload-user]
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Reading...
module.frontend_bucket["prod"].aws_s3_bucket_public_access_block.frontend_s3_bucket_public_acl: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration: Refreshing state... [id=bata-media-frontend-prod]
module.frontend_bucket["prod"].aws_cloudfront_distribution.frontend_cloudfront_distribution: Refreshing state... [id=E38Z5KAIBO7480]
module.frontend_bucket["prod"].data.aws_iam_policy_document.frontend_allow_cloudfront: Read complete after 0s [id=1577279431]
module.frontend_bucket["prod"].aws_s3_bucket_policy.frontend_s3_bucket_policy: Refreshing state... [id=bata-media-frontend-prod]
aws_s3_bucket_public_access_block.mysql_s3_bucket_public_acl: Refreshing state... [id=bata-media-db-backup]
aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle: Refreshing state... [id=bata-media-db-backup]
aws_iam_policy.mysql_backup_upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-db-backup-db-backup-policy]
aws_iam_user.mysql_backup_upload_user: Refreshing state... [id=bata-media-db-backup-db-backup-user]
aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership: Refreshing state... [id=bata-media-db-backup]
module.photo_bucket["prod"].aws_s3_bucket_public_access_block.photo_s3_bucket_public_acl: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_s3_bucket_lifecycle_configuration.photo_s3_bucket_lifecycle: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_iam_user.upload_user: Refreshing state... [id=bata-media-photo-prod-upload-user]
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Reading...
module.photo_bucket["prod"].data.aws_iam_policy_document.photo_allow_cloudfront: Read complete after 0s [id=1452836004]
module.photo_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-photo-prod-upload-policy]
module.photo_bucket["prod"].aws_s3_bucket_website_configuration.photo_s3_bucket_website_configuration: Refreshing state... [id=bata-media-photo-prod]
module.frontend_bucket["prod"].aws_iam_policy.upload_user_policy: Refreshing state... [id=arn:aws:iam::172483268424:policy/bata-media-frontend-prod-upload-policy]
module.frontend_bucket["prod"].aws_s3_bucket_acl.frontend_s3_bucket_acl: Refreshing state... [id=bata-media-frontend-prod,private]
aws_iam_user_policy_attachment.mysql_backup_user_attachment: Refreshing state... [id=bata-media-db-backup-db-backup-user-20250328201628443000000007]
module.photo_bucket["prod"].aws_s3_bucket_policy.photo_s3_bucket_policy: Refreshing state... [id=bata-media-photo-prod]
module.photo_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-photo-prod-upload-user-2025032820173573590000000b]
module.frontend_bucket["prod"].aws_iam_user_policy_attachment.upload_user_attachment: Refreshing state... [id=bata-media-frontend-prod-upload-user-2025032820223431810000000d]
module.route53["prod"].aws_route53_record.frontend_bucket_record_a: Refreshing state... [id=Z04677781OQ1QDD432K8J_www_A]
module.photo_bucket["prod"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors: Refreshing state... [id=bata-media-photo-prod]
module.route53["prod"].aws_route53_record.frontend_bucket_record_aaaa: Refreshing state... [id=Z04677781OQ1QDD432K8J_www_AAAA]
module.photo_bucket["prod"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy: Refreshing state... [id=a2b677b2-9e82-45ba-a596-f02bbd373d52]
aws_s3_bucket_acl.mysql_s3_bucket_acl: Refreshing state... [id=bata-media-db-backup,private]
module.photo_bucket["prod"].aws_cloudfront_distribution.photo_cloudfront_distribution: Refreshing state... [id=E33EP76ZM4MG42]
module.route53["prod"].aws_route53_record.photo_bucket_record_a: Refreshing state... [id=Z04677781OQ1QDD432K8J_assets_A]
module.route53["prod"].aws_route53_record.photo_bucket_record_aaaa: Refreshing state... [id=Z04677781OQ1QDD432K8J_assets_AAAA]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.frontend_bucket["prod"].aws_cloudfront_distribution.frontend_cloudfront_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "frontend_cloudfront_distribution" {
      ~ aliases                         = [
          - "foto.batavierenrace.nl",
          - "www.foto.batavierenrace.nl",
          + "fotos.batavierenrace.nl",
          + "www.fotos.batavierenrace.nl",
        ]
        id                              = "E38Z5KAIBO7480"
        tags                            = {}
        # (22 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:172483268424:certificate/411d3e09-0a4e-4ed1-b73d-9c7e69d9d2da" -> "arn:aws:acm:us-east-1:172483268424:certificate/31af764e-4a4e-4586-a7e3-93cce81656ba"
            # (4 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.frontend_bucket["prod"].aws_s3_bucket_website_configuration.frontend_s3_bucket_website_configuration will be updated in-place
  ~ resource "aws_s3_bucket_website_configuration" "frontend_s3_bucket_website_configuration" {
        id                    = "bata-media-frontend-prod"
        # (5 unchanged attributes hidden)

      ~ routing_rule {
          ~ redirect {
              ~ host_name               = "foto.batavierenrace.nl" -> "fotos.batavierenrace.nl"
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.photo_bucket["prod"].aws_cloudfront_distribution.photo_cloudfront_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "photo_cloudfront_distribution" {
      ~ aliases                         = [
          - "assets.foto.batavierenrace.nl",
          + "assets.fotos.batavierenrace.nl",
        ]
        id                              = "E33EP76ZM4MG42"
        tags                            = {}
        # (22 unchanged attributes hidden)

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:172483268424:certificate/411d3e09-0a4e-4ed1-b73d-9c7e69d9d2da" -> "arn:aws:acm:us-east-1:172483268424:certificate/31af764e-4a4e-4586-a7e3-93cce81656ba"
            # (4 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.photo_bucket["prod"].aws_cloudfront_response_headers_policy.photo_cloudfront_response_headers_policy will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "photo_cloudfront_response_headers_policy" {
        id      = "a2b677b2-9e82-45ba-a596-f02bbd373d52"
        name    = "MediaCorsResponseHeadersPolicy-prod"
        # (3 unchanged attributes hidden)

      ~ cors_config {
            # (3 unchanged attributes hidden)

          ~ access_control_allow_origins {
              ~ items = [
                  - "https://foto.batavierenrace.nl",
                  - "https://www.foto.batavierenrace.nl",
                  + "https://fotos.batavierenrace.nl",
                  + "https://www.fotos.batavierenrace.nl",
                ]
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.photo_bucket["prod"].aws_s3_bucket_cors_configuration.photo_s3_bucket_cors will be updated in-place
  ~ resource "aws_s3_bucket_cors_configuration" "photo_s3_bucket_cors" {
        id                    = "bata-media-photo-prod"
        # (2 unchanged attributes hidden)

      - cors_rule {
          - allowed_headers = [] -> null
          - allowed_methods = [
              - "GET",
              - "POST",
            ] -> null
          - allowed_origins = [
              - "https://foto.batavierenrace.nl",
              - "https://www.foto.batavierenrace.nl",
            ] -> null
          - expose_headers  = [] -> null
            id              = null
          - max_age_seconds = 0 -> null
        }
      + cors_rule {
          + allowed_headers = []
          + allowed_methods = [
              + "GET",
              + "POST",
            ]
          + allowed_origins = [
              + "https://fotos.batavierenrace.nl",
              + "https://www.fotos.batavierenrace.nl",
            ]
          + expose_headers  = []
            id              = null
        }
    }

  # module.processing_queue["prod"].aws_lambda_function.processing_lambda will be updated in-place
  ~ resource "aws_lambda_function" "processing_lambda" {
        id                             = "photo-processing-lambda-prod"
      ~ last_modified                  = "2025-03-30T19:11:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "YLIv5loPMZ+5jE2BX3sZPzaIsE6yho2iOzDkQ7TMIT8=" -> "/nNz5FjkRSZWZ/VWwVekdNVnD9gn7Og2ca5/dFS7jMk="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.route53["prod"].aws_route53_record.frontend_bucket_record_a must be replaced
-/+ resource "aws_route53_record" "frontend_bucket_record_a" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "www.foto.batavierenrace.nl" -> (known after apply)
      ~ id                               = "Z04677781OQ1QDD432K8J_www_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "www"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z04677781OQ1QDD432K8J" -> "Z0501357TFKZ7NM83UD2" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.route53["prod"].aws_route53_record.frontend_bucket_record_aaaa must be replaced
-/+ resource "aws_route53_record" "frontend_bucket_record_aaaa" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "www.foto.batavierenrace.nl" -> (known after apply)
      ~ id                               = "Z04677781OQ1QDD432K8J_www_AAAA" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "www"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z04677781OQ1QDD432K8J" -> "Z0501357TFKZ7NM83UD2" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.route53["prod"].aws_route53_record.photo_bucket_record_a must be replaced
-/+ resource "aws_route53_record" "photo_bucket_record_a" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "assets.foto.batavierenrace.nl" -> (known after apply)
      ~ id                               = "Z04677781OQ1QDD432K8J_assets_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "assets"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z04677781OQ1QDD432K8J" -> "Z0501357TFKZ7NM83UD2" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.route53["prod"].aws_route53_record.photo_bucket_record_aaaa must be replaced
-/+ resource "aws_route53_record" "photo_bucket_record_aaaa" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "assets.foto.batavierenrace.nl" -> (known after apply)
      ~ id                               = "Z04677781OQ1QDD432K8J_assets_AAAA" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "assets"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z04677781OQ1QDD432K8J" -> "Z0501357TFKZ7NM83UD2" # forces replacement
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 6 to change, 4 to destroy.

Warning: Invalid Attribute Combination

  with aws_s3_bucket_lifecycle_configuration.mysql_s3_bucket_lifecycle,
  on mysql-backup.tf line 24, in resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle":
  24: resource "aws_s3_bucket_lifecycle_configuration" "mysql_s3_bucket_lifecycle" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @jonathanjuursema*